test/request-response-samples/getAvailability__should_not_fail_without_children/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:foo="http://foo.bar/doIt/" xmlns:partner="http://foo.bar/partner/"><soap:Body><foo:getAvailability><userCredentials><username>beeblebrox</username><sessionid>42</sessionid></userCredentials><getAvailabilityRequest><departure>HAM</departure><destination>FRA</destination><flightDate>2016-01-01</flightDate><returnDate>2016-02-01</returnDate><paxCount count="1" paxType="ADT"></paxCount></getAvailabilityRequest></foo:getAvailability></soap:Body></soap:Envelope>
